In [2]:
import os
import pandas as pd
import altair as alt

cwd = os.getcwd()
data_dir = os.path.join(cwd, 'data')
source_dir = os.path.join(data_dir,'source')
processed_dir = os.path.join(data_dir, 'processed')
pkl_dir = os.path.join(processed_dir,'pkl')

# Data has been cleaned and saved as a pickle 
discipline_pkl = os.path.join(pkl_dir, 'cleaned_new_discipline_data.pkl')
discipline_df = pd.read_pickle(discipline_pkl)

# the discipline data that is one-row-per-incident
incident_xlsx = os.path.join(source_dir, '2010-2020.xlsx')
incident_df = pd.read_excel(incident_xlsx)

In [3]:
unique_officers = discipline_df.groupby(
    [
        'first_name',
        'last_name',
    ]
).agg(
    {'officer_employee_num':'nunique'}
).reset_index()

unique_officers.to_csv('unique_officers.csv')

In [4]:
discipline_df.groupby(
    [
        'first_name',
        'last_name',
        'officer_employee_num'
        #'allegation'
    ]
).agg(
    {'allegation':'nunique'}
).reset_index()

     first_name     last_name officer_employee_num  allegation
0         0John  09Hatcher Jr               226016           7
1         Aaron         Jones               562543          29
2         Aaron     Thomas II               433764          19
3         Aaron     Thomas Sr               226641          14
4         Aaron     Wigginton               226175           4
...         ...           ...                  ...         ...
2586    Zachary         Plese               311325           1
2587    Zachary         Ronan               161942           5
2588    Zachary         Scott               279206           2
2589    Zachary         White               151136           9
2590      Zaire        Murray               337277           1

[2591 rows x 4 columns]

# TO DO 
# join w/ fuzzy string matching the new name + race data to the old incident data.

In [5]:
from fuzzywuzzy import process

In [6]:
discipline_df['full_name'] = discipline_df['first_name'] + ' ' + discipline_df['last_name']
incident_df['full_name'] = incident_df['EMPLOYEE FIRST NAME'] + ' ' + incident_df['EMPLOYEE LAST NAME']

In [7]:
discipline_list = list(discipline_df['full_name'].unique())

In [8]:
incident_name_list = list(incident_df['full_name'].unique())

In [9]:
for name in discipline_list[0:10]:
    print(name)
    print(process.extract(name, incident_name_list, limit=5))

Henry Particelli
[('HENRY PARTICELLI', 100), ('JOHN HENRY', 86), ('HENRY PHILLIPS', 73), ('WILLIAM HENRY', 66), ('DEON CARTMELL', 62)]
Ryan Allen
[('RYAN ALLEN', 100), ('BRIAN ALLEN', 86), ('RYAN CAGLE', 80), ('WANDA ALLEN', 76), ('RYAN COLL', 74)]
Ryan Fink
[('RYAN FINK', 100), ('FYAN FINK', 89), ('RYAN KOZLOWSKI', 86), ('RYAN CAULFIELD', 86), ('RYAN FINNEGAN', 73)]
Michael Dudley
[('MICHAEL DUDLEY', 100), ('MICHAEL LEE', 80), ('MICHAEL EBY', 80), ('MICHAEL DYE', 80), ('MICHAEL BUTLER', 79)]
Timothy Durham
[('TIMOTHY DURHAM', 100), ('TIMOTHY MORGAN', 71), ('TIMOTHY REID', 70), ('TIMOTHY MEAD', 70), ('TIMOTHY WARD', 70)]
Adam Thomas
[('ADAM THOMAS', 100), ('AARON THOMAS', 78), ('JAMES THOMAS', 78), ('LAURA THOMAS', 78), ('THOMAS ODOM', 78)]
George Oden
[('GEORGE ODEN', 100), ('GEORGE BOUTON', 75), ('GEORGE GANT', 73), ('GEORGE WARD', 73), ('GEORGE SPENCER', 72)]
Bryan Moore
[('BRYAN MOORE', 100), ('BRYAN CRUTCHFIELD', 86), ('BRANDON MOORE', 83), ('RANDALL MOORE', 75), ('RYAN COE', 74)]
Michael Evans
[('MICHAEL EVANS', 100), ('MICHAEL EVA', 92), ('MICHAEL NIEVES', 81), ('MICHAEL ADKINS', 81), ('MICHAEL VAUGHN', 81)]
Christopher Taylor
[('CHRISTOPHER TAYLOR', 100), ('CHRSTOPHER TAYLOR', 97), ('CHRISTOPHER LO', 88), ('ALLEN TAYLOR', 86), ('AMY TAYLOR', 86)]

In [10]:
unique_officers_2 = discipline_df[
    ['full_name','officer_employee_num', 'date_hired']
].drop_duplicates()

unique_officers_2[unique_officers_2.full_name=='Joseph Smith']

         full_name officer_employee_num date_hired
6926  Joseph Smith               224793 1995-10-01
7995  Joseph Smith               268179 2000-05-01

In [34]:
df = unique_officers_2.full_name.value_counts().reset_index()

df[df.full_name==1]

                  index  full_name
49         James Pearce          1
50     William Kautzman          1
51       Jonathan Riggs          1
52       Samuel Kersten          1
53    Mitchell Tolzmann          1
...                 ...        ...
2559    Charles Widener          1
2560       Bryce Hatten          1
2561     Thomas Broatch          1
2562     Michael Freels          1
2563        Brad Houser          1

[2515 rows x 2 columns]

In [30]:
49/2500

0.0196